Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/flexcom.h
/**
 * \brief Component description for FLEXCOM
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-02-03T17:22:07Z */
#ifndef _SAMRH71_FLEXCOM_COMPONENT_H_
#define _SAMRH71_FLEXCOM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FLEXCOM                                      */
/* ************************************************************************** */

/* -------- FLEX_MR : (FLEXCOM Offset: 0x00) (R/W 32) FLEXCOM Mode Register -------- */
#define FLEX_MR_OPMODE_Pos                    _U_(0)                                               /**< (FLEX_MR) FLEXCOM Operating Mode Position */
#define FLEX_MR_OPMODE_Msk                    (_U_(0x3) << FLEX_MR_OPMODE_Pos)                     /**< (FLEX_MR) FLEXCOM Operating Mode Mask */
#define FLEX_MR_OPMODE(value)                 (FLEX_MR_OPMODE_Msk & ((value) << FLEX_MR_OPMODE_Pos))
#define   FLEX_MR_OPMODE_NO_COM_Val           _U_(0x0)                                             /**< (FLEX_MR) No communication  */
#define   FLEX_MR_OPMODE_USART_Val            _U_(0x1)                                             /**< (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN, LON)SPI/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_SPI_Val              _U_(0x2)                                             /**< (FLEX_MR) SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_TWI_Val              _U_(0x3)                                             /**< (FLEX_MR) All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs.  */
#define FLEX_MR_OPMODE_NO_COM                 (FLEX_MR_OPMODE_NO_COM_Val << FLEX_MR_OPMODE_Pos)    /**< (FLEX_MR) No communication Position  */
#define FLEX_MR_OPMODE_USART                  (FLEX_MR_OPMODE_USART_Val << FLEX_MR_OPMODE_Pos)     /**< (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN, LON)SPI/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_SPI                    (FLEX_MR_OPMODE_SPI_Val << FLEX_MR_OPMODE_Pos)       /**< (FLEX_MR) SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_TWI                    (FLEX_MR_OPMODE_TWI_Val << FLEX_MR_OPMODE_Pos)       /**< (FLEX_MR) All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_Msk                           _U_(0x00000003)                                      /**< (FLEX_MR) Register Mask  */


/* -------- FLEX_RHR : (FLEXCOM Offset: 0x10) ( R/ 32) FLEXCOM Receive Holding Register -------- */
#define FLEX_RHR_RXDATA_Pos                   _U_(0)                                               /**< (FLEX_RHR) Receive Data Position */
#define FLEX_RHR_RXDATA_Msk                   (_U_(0xFFFF) << FLEX_RHR_RXDATA_Pos)                 /**< (FLEX_RHR) Receive Data Mask */
#define FLEX_RHR_RXDATA(value)                (FLEX_RHR_RXDATA_Msk & ((value) << FLEX_RHR_RXDATA_Pos))
#define FLEX_RHR_Msk                          _U_(0x0000FFFF)                                      /**< (FLEX_RHR) Register Mask  */


/* -------- FLEX_THR : (FLEXCOM Offset: 0x20) (R/W 32) FLEXCOM Transmit Holding Register -------- */
#define FLEX_THR_TXDATA_Pos                   _U_(0)                                               /**< (FLEX_THR) Transmit Data Position */
#define FLEX_THR_TXDATA_Msk                   (_U_(0xFFFF) << FLEX_THR_TXDATA_Pos)                 /**< (FLEX_THR) Transmit Data Mask */
#define FLEX_THR_TXDATA(value)                (FLEX_THR_TXDATA_Msk & ((value) << FLEX_THR_TXDATA_Pos))
#define FLEX_THR_Msk                          _U_(0x0000FFFF)                                      /**< (FLEX_THR) Register Mask  */


/* -------- FLEX_US_CR : (FLEXCOM Offset: 0x200) ( /W 32) USART Control Register -------- */
#define FLEX_US_CR_RSTRX_Pos                  _U_(2)                                               /**< (FLEX_US_CR) Reset Receiver Position */
#define FLEX_US_CR_RSTRX_Msk                  (_U_(0x1) << FLEX_US_CR_RSTRX_Pos)                   /**< (FLEX_US_CR) Reset Receiver Mask */
#define FLEX_US_CR_RSTRX(value)               (FLEX_US_CR_RSTRX_Msk & ((value) << FLEX_US_CR_RSTRX_Pos))
#define FLEX_US_CR_RSTTX_Pos                  _U_(3)                                               /**< (FLEX_US_CR) Reset Transmitter Position */
#define FLEX_US_CR_RSTTX_Msk                  (_U_(0x1) << FLEX_US_CR_RSTTX_Pos)                   /**< (FLEX_US_CR) Reset Transmitter Mask */
#define FLEX_US_CR_RSTTX(value)               (FLEX_US_CR_RSTTX_Msk & ((value) << FLEX_US_CR_RSTTX_Pos))
#define FLEX_US_CR_RXEN_Pos                   _U_(4)                                               /**< (FLEX_US_CR) Receiver Enable Position */
#define FLEX_US_CR_RXEN_Msk                   (_U_(0x1) << FLEX_US_CR_RXEN_Pos)                    /**< (FLEX_US_CR) Receiver Enable Mask */
#define FLEX_US_CR_RXEN(value)                (FLEX_US_CR_RXEN_Msk & ((value) << FLEX_US_CR_RXEN_Pos))
#define FLEX_US_CR_RXDIS_Pos                  _U_(5)                                               /**< (FLEX_US_CR) Receiver Disable Position */
#define FLEX_US_CR_RXDIS_Msk                  (_U_(0x1) << FLEX_US_CR_RXDIS_Pos)                   /**< (FLEX_US_CR) Receiver Disable Mask */
#define FLEX_US_CR_RXDIS(value)               (FLEX_US_CR_RXDIS_Msk & ((value) << FLEX_US_CR_RXDIS_Pos))
#define FLEX_US_CR_TXEN_Pos                   _U_(6)                                               /**< (FLEX_US_CR) Transmitter Enable Position */
#define FLEX_US_CR_TXEN_Msk                   (_U_(0x1) << FLEX_US_CR_TXEN_Pos)                    /**< (FLEX_US_CR) Transmitter Enable Mask */
#define FLEX_US_CR_TXEN(value)                (FLEX_US_CR_TXEN_Msk & ((value) << FLEX_US_CR_TXEN_Pos))
#define FLEX_US_CR_TXDIS_Pos                  _U_(7)                                               /**< (FLEX_US_CR) Transmitter Disable Position */
#define FLEX_US_CR_TXDIS_Msk                  (_U_(0x1) << FLEX_US_CR_TXDIS_Pos)                   /**< (FLEX_US_CR) Transmitter Disable Mask */
#define FLEX_US_CR_TXDIS(value)               (FLEX_US_CR_TXDIS_Msk & ((value) << FLEX_US_CR_TXDIS_Pos))
#define FLEX_US_CR_RSTSTA_Pos                 _U_(8)                                               /**< (FLEX_US_CR) Reset Status Bits Position */
#define FLEX_US_CR_RSTSTA_Msk                 (_U_(0x1) << FLEX_US_CR_RSTSTA_Pos)                  /**< (FLEX_US_CR) Reset Status Bits Mask */
#define FLEX_US_CR_RSTSTA(value)              (FLEX_US_CR_RSTSTA_Msk & ((value) << FLEX_US_CR_RSTSTA_Pos))
#define FLEX_US_CR_STTBRK_Pos                 _U_(9)                                               /**< (FLEX_US_CR) Start Break Position */
#define FLEX_US_CR_STTBRK_Msk                 (_U_(0x1) << FLEX_US_CR_STTBRK_Pos)                  /**< (FLEX_US_CR) Start Break Mask */
#define FLEX_US_CR_STTBRK(value)              (FLEX_US_CR_STTBRK_Msk & ((value) << FLEX_US_CR_STTBRK_Pos))
#define FLEX_US_CR_STPBRK_Pos                 _U_(10)                                              /**< (FLEX_US_CR) Stop Break Position */
#define FLEX_US_CR_STPBRK_Msk                 (_U_(0x1) << FLEX_US_CR_STPBRK_Pos)                  /**< (FLEX_US_CR) Stop Break Mask */
#define FLEX_US_CR_STPBRK(value)              (FLEX_US_CR_STPBRK_Msk & ((value) << FLEX_US_CR_STPBRK_Pos))
#define FLEX_US_CR_STTTO_Pos                  _U_(11)                                              /**< (FLEX_US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Position */
#define FLEX_US_CR_STTTO_Msk                  (_U_(0x1) << FLEX_US_CR_STTTO_Pos)                   /**< (FLEX_US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Mask */
#define FLEX_US_CR_STTTO(value)               (FLEX_US_CR_STTTO_Msk & ((value) << FLEX_US_CR_STTTO_Pos))
#define FLEX_US_CR_SENDA_Pos                  _U_(12)                                              /**< (FLEX_US_CR) Send Address Position */
#define FLEX_US_CR_SENDA_Msk                  (_U_(0x1) << FLEX_US_CR_SENDA_Pos)                   /**< (FLEX_US_CR) Send Address Mask */
#define FLEX_US_CR_SENDA(value)               (FLEX_US_CR_SENDA_Msk & ((value) << FLEX_US_CR_SENDA_Pos))
#define FLEX_US_CR_RSTIT_Pos                  _U_(13)                                              /**< (FLEX_US_CR) Reset Iterations Position */
#define FLEX_US_CR_RSTIT_Msk                  (_U_(0x1) << FLEX_US_CR_RSTIT_Pos)                   /**< (FLEX_US_CR) Reset Iterations Mask */
#define FLEX_US_CR_RSTIT(value)               (FLEX_US_CR_RSTIT_Msk & ((value) << FLEX_US_CR_RSTIT_Pos))
#define FLEX_US_CR_RSTNACK_Pos                _U_(14)                                              /**< (FLEX_US_CR) Reset Non Acknowledge Position */
#define FLEX_US_CR_RSTNACK_Msk                (_U_(0x1) << FLEX_US_CR_RSTNACK_Pos)                 /**< (FLEX_US_CR) Reset Non Acknowledge Mask */
#define FLEX_US_CR_RSTNACK(value)             (FLEX_US_CR_RSTNACK_Msk & ((value) << FLEX_US_CR_RSTNACK_Pos))
#define FLEX_US_CR_RETTO_Pos                  _U_(15)                                              /**< (FLEX_US_CR) Start Timeout Immediately Position */
#define FLEX_US_CR_RETTO_Msk                  (_U_(0x1) << FLEX_US_CR_RETTO_Pos)                   /**< (FLEX_US_CR) Start Timeout Immediately Mask */
#define FLEX_US_CR_RETTO(value)               (FLEX_US_CR_RETTO_Msk & ((value) << FLEX_US_CR_RETTO_Pos))
#define FLEX_US_CR_RTSEN_Pos                  _U_(18)                                              /**< (FLEX_US_CR) Request to Send Enable Position */
#define FLEX_US_CR_RTSEN_Msk                  (_U_(0x1) << FLEX_US_CR_RTSEN_Pos)                   /**< (FLEX_US_CR) Request to Send Enable Mask */
#define FLEX_US_CR_RTSEN(value)               (FLEX_US_CR_RTSEN_Msk & ((value) << FLEX_US_CR_RTSEN_Pos))
#define FLEX_US_CR_RTSDIS_Pos                 _U_(19)                                              /**< (FLEX_US_CR) Request to Send Disable Position */
#define FLEX_US_CR_RTSDIS_Msk                 (_U_(0x1) << FLEX_US_CR_RTSDIS_Pos)                  /**< (FLEX_US_CR) Request to Send Disable Mask */
#define FLEX_US_CR_RTSDIS(value)              (FLEX_US_CR_RTSDIS_Msk & ((value) << FLEX_US_CR_RTSDIS_Pos))
#define FLEX_US_CR_LINABT_Pos                 _U_(20)                                              /**< (FLEX_US_CR) Abort LIN Transmission Position */
#define FLEX_US_CR_LINABT_Msk                 (_U_(0x1) << FLEX_US_CR_LINABT_Pos)                  /**< (FLEX_US_CR) Abort LIN Transmission Mask */
#define FLEX_US_CR_LINABT(value)              (FLEX_US_CR_LINABT_Msk & ((value) << FLEX_US_CR_LINABT_Pos))
#define FLEX_US_CR_LINWKUP_Pos                _U_(21)                                              /**< (FLEX_US_CR) Send LIN Wakeup Signal Position */
#define FLEX_US_CR_LINWKUP_Msk                (_U_(0x1) << FLEX_US_CR_LINWKUP_Pos)                 /**< (FLEX_US_CR) Send LIN Wakeup Signal Mask */
#define FLEX_US_CR_LINWKUP(value)             (FLEX_US_CR_LINWKUP_Msk & ((value) << FLEX_US_CR_LINWKUP_Pos))
#define FLEX_US_CR_TXFCLR_Pos                 _U_(24)                                              /**< (FLEX_US_CR) Transmit FIFO Clear Position */
#define FLEX_US_CR_TXFCLR_Msk                 (_U_(0x1) << FLEX_US_CR_TXFCLR_Pos)                  /**< (FLEX_US_CR) Transmit FIFO Clear Mask */
#define FLEX_US_CR_TXFCLR(value)              (FLEX_US_CR_TXFCLR_Msk & ((value) << FLEX_US_CR_TXFCLR_Pos))
#define FLEX_US_CR_RXFCLR_Pos                 _U_(25)                                              /**< (FLEX_US_CR) Receive FIFO Clear Position */
#define FLEX_US_CR_RXFCLR_Msk                 (_U_(0x1) << FLEX_US_CR_RXFCLR_Pos)                  /**< (FLEX_US_CR) Receive FIFO Clear Mask */
#define FLEX_US_CR_RXFCLR(value)              (FLEX_US_CR_RXFCLR_Msk & ((value) << FLEX_US_CR_RXFCLR_Pos))
#define FLEX_US_CR_TXFLCLR_Pos                _U_(26)                                              /**< (FLEX_US_CR) Transmit FIFO Lock CLEAR Position */
#define FLEX_US_CR_TXFLCLR_Msk                (_U_(0x1) << FLEX_US_CR_TXFLCLR_Pos)                 /**< (FLEX_US_CR) Transmit FIFO Lock CLEAR Mask */
#define FLEX_US_CR_TXFLCLR(value)             (FLEX_US_CR_TXFLCLR_Msk & ((value) << FLEX_US_CR_TXFLCLR_Pos))
#define FLEX_US_CR_REQCLR_Pos                 _U_(28)                                              /**< (FLEX_US_CR) Request to Clear the Comparison Trigger Position */
#define FLEX_US_CR_REQCLR_Msk                 (_U_(0x1) << FLEX_US_CR_REQCLR_Pos)                  /**< (FLEX_US_CR) Request to Clear the Comparison Trigger Mask */
#define FLEX_US_CR_REQCLR(value)              (FLEX_US_CR_REQCLR_Msk & ((value) << FLEX_US_CR_REQCLR_Pos))
#define FLEX_US_CR_FIFOEN_Pos                 _U_(30)                                              /**< (FLEX_US_CR) FIFO Enable Position */
#define FLEX_US_CR_FIFOEN_Msk                 (_U_(0x1) << FLEX_US_CR_FIFOEN_Pos)                  /**< (FLEX_US_CR) FIFO Enable Mask */
#define FLEX_US_CR_FIFOEN(value)              (FLEX_US_CR_FIFOEN_Msk & ((value) << FLEX_US_CR_FIFOEN_Pos))
#define FLEX_US_CR_FIFODIS_Pos                _U_(31)                                              /**< (FLEX_US_CR) FIFO Disable Position */
#define FLEX_US_CR_FIFODIS_Msk                (_U_(0x1) << FLEX_US_CR_FIFODIS_Pos)                 /**< (FLEX_US_CR) FIFO Disable Mask */
#define FLEX_US_CR_FIFODIS(value)             (FLEX_US_CR_FIFODIS_Msk & ((value) << FLEX_US_CR_FIFODIS_Pos))
#define FLEX_US_CR_Msk                        _U_(0xD73CFFFC)                                      /**< (FLEX_US_CR) Register Mask  */


