Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/flexcom.h
/* -------- FLEX_US_MR : (FLEXCOM Offset: 0x204) (R/W 32) USART Mode Register -------- */
#define FLEX_US_MR_USART_MODE_Pos             _U_(0)                                               /**< (FLEX_US_MR) USART Mode of Operation Position */
#define FLEX_US_MR_USART_MODE_Msk             (_U_(0xF) << FLEX_US_MR_USART_MODE_Pos)              /**< (FLEX_US_MR) USART Mode of Operation Mask */
#define FLEX_US_MR_USART_MODE(value)          (FLEX_US_MR_USART_MODE_Msk & ((value) << FLEX_US_MR_USART_MODE_Pos))
#define   FLEX_US_MR_USART_MODE_NORMAL_Val    _U_(0x0)                                             /**< (FLEX_US_MR) Normal mode  */
#define   FLEX_US_MR_USART_MODE_RS485_Val     _U_(0x1)                                             /**< (FLEX_US_MR) RS485  */
#define   FLEX_US_MR_USART_MODE_HW_HANDSHAKING_Val _U_(0x2)                                             /**< (FLEX_US_MR) Hardware handshaking  */
#define   FLEX_US_MR_USART_MODE_IS07816_T_0_Val _U_(0x4)                                             /**< (FLEX_US_MR) IS07816 Protocol: T = 0  */
#define   FLEX_US_MR_USART_MODE_IS07816_T_1_Val _U_(0x6)                                             /**< (FLEX_US_MR) IS07816 Protocol: T = 1  */
#define   FLEX_US_MR_USART_MODE_IRDA_Val      _U_(0x8)                                             /**< (FLEX_US_MR) IrDA  */
#define   FLEX_US_MR_USART_MODE_LON_Val       _U_(0x9)                                             /**< (FLEX_US_MR) LON  */
#define   FLEX_US_MR_USART_MODE_LIN_MASTER_Val _U_(0xA)                                             /**< (FLEX_US_MR) LIN Master mode  */
#define   FLEX_US_MR_USART_MODE_LIN_SLAVE_Val _U_(0xB)                                             /**< (FLEX_US_MR) LIN Slave mode  */
#define FLEX_US_MR_USART_MODE_NORMAL          (FLEX_US_MR_USART_MODE_NORMAL_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) Normal mode Position  */
#define FLEX_US_MR_USART_MODE_RS485           (FLEX_US_MR_USART_MODE_RS485_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) RS485 Position  */
#define FLEX_US_MR_USART_MODE_HW_HANDSHAKING  (FLEX_US_MR_USART_MODE_HW_HANDSHAKING_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) Hardware handshaking Position  */
#define FLEX_US_MR_USART_MODE_IS07816_T_0     (FLEX_US_MR_USART_MODE_IS07816_T_0_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) IS07816 Protocol: T = 0 Position  */
#define FLEX_US_MR_USART_MODE_IS07816_T_1     (FLEX_US_MR_USART_MODE_IS07816_T_1_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) IS07816 Protocol: T = 1 Position  */
#define FLEX_US_MR_USART_MODE_IRDA            (FLEX_US_MR_USART_MODE_IRDA_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) IrDA Position  */
#define FLEX_US_MR_USART_MODE_LON             (FLEX_US_MR_USART_MODE_LON_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) LON Position  */
#define FLEX_US_MR_USART_MODE_LIN_MASTER      (FLEX_US_MR_USART_MODE_LIN_MASTER_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) LIN Master mode Position  */
#define FLEX_US_MR_USART_MODE_LIN_SLAVE       (FLEX_US_MR_USART_MODE_LIN_SLAVE_Val << FLEX_US_MR_USART_MODE_Pos) /**< (FLEX_US_MR) LIN Slave mode Position  */
#define FLEX_US_MR_USCLKS_Pos                 _U_(4)                                               /**< (FLEX_US_MR) Clock Selection Position */
#define FLEX_US_MR_USCLKS_Msk                 (_U_(0x3) << FLEX_US_MR_USCLKS_Pos)                  /**< (FLEX_US_MR) Clock Selection Mask */
#define FLEX_US_MR_USCLKS(value)              (FLEX_US_MR_USCLKS_Msk & ((value) << FLEX_US_MR_USCLKS_Pos))
#define   FLEX_US_MR_USCLKS_MCK_Val           _U_(0x0)                                             /**< (FLEX_US_MR) Peripheral clock is selected  */
#define   FLEX_US_MR_USCLKS_DIV_Val           _U_(0x1)                                             /**< (FLEX_US_MR) Peripheral clock divided (DIV = 8) is selected  */
#define   FLEX_US_MR_USCLKS_GCLK_Val          _U_(0x2)                                             /**< (FLEX_US_MR) PMC generic clock is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   FLEX_US_MR_USCLKS_SCK_Val           _U_(0x3)                                             /**< (FLEX_US_MR) External pin SCK is selected  */
#define FLEX_US_MR_USCLKS_MCK                 (FLEX_US_MR_USCLKS_MCK_Val << FLEX_US_MR_USCLKS_Pos) /**< (FLEX_US_MR) Peripheral clock is selected Position  */
#define FLEX_US_MR_USCLKS_DIV                 (FLEX_US_MR_USCLKS_DIV_Val << FLEX_US_MR_USCLKS_Pos) /**< (FLEX_US_MR) Peripheral clock divided (DIV = 8) is selected Position  */
#define FLEX_US_MR_USCLKS_GCLK                (FLEX_US_MR_USCLKS_GCLK_Val << FLEX_US_MR_USCLKS_Pos) /**< (FLEX_US_MR) PMC generic clock is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position  */
#define FLEX_US_MR_USCLKS_SCK                 (FLEX_US_MR_USCLKS_SCK_Val << FLEX_US_MR_USCLKS_Pos) /**< (FLEX_US_MR) External pin SCK is selected Position  */
#define FLEX_US_MR_CHRL_Pos                   _U_(6)                                               /**< (FLEX_US_MR) Character Length Position */
#define FLEX_US_MR_CHRL_Msk                   (_U_(0x3) << FLEX_US_MR_CHRL_Pos)                    /**< (FLEX_US_MR) Character Length Mask */
#define FLEX_US_MR_CHRL(value)                (FLEX_US_MR_CHRL_Msk & ((value) << FLEX_US_MR_CHRL_Pos))
#define   FLEX_US_MR_CHRL_5_BIT_Val           _U_(0x0)                                             /**< (FLEX_US_MR) Character length is 5 bits  */
#define   FLEX_US_MR_CHRL_6_BIT_Val           _U_(0x1)                                             /**< (FLEX_US_MR) Character length is 6 bits  */
#define   FLEX_US_MR_CHRL_7_BIT_Val           _U_(0x2)                                             /**< (FLEX_US_MR) Character length is 7 bits  */
#define   FLEX_US_MR_CHRL_8_BIT_Val           _U_(0x3)                                             /**< (FLEX_US_MR) Character length is 8 bits  */
#define FLEX_US_MR_CHRL_5_BIT                 (FLEX_US_MR_CHRL_5_BIT_Val << FLEX_US_MR_CHRL_Pos)   /**< (FLEX_US_MR) Character length is 5 bits Position  */
#define FLEX_US_MR_CHRL_6_BIT                 (FLEX_US_MR_CHRL_6_BIT_Val << FLEX_US_MR_CHRL_Pos)   /**< (FLEX_US_MR) Character length is 6 bits Position  */
#define FLEX_US_MR_CHRL_7_BIT                 (FLEX_US_MR_CHRL_7_BIT_Val << FLEX_US_MR_CHRL_Pos)   /**< (FLEX_US_MR) Character length is 7 bits Position  */
#define FLEX_US_MR_CHRL_8_BIT                 (FLEX_US_MR_CHRL_8_BIT_Val << FLEX_US_MR_CHRL_Pos)   /**< (FLEX_US_MR) Character length is 8 bits Position  */
#define FLEX_US_MR_SYNC_Pos                   _U_(8)                                               /**< (FLEX_US_MR) Synchronous Mode Select Position */
#define FLEX_US_MR_SYNC_Msk                   (_U_(0x1) << FLEX_US_MR_SYNC_Pos)                    /**< (FLEX_US_MR) Synchronous Mode Select Mask */
#define FLEX_US_MR_SYNC(value)                (FLEX_US_MR_SYNC_Msk & ((value) << FLEX_US_MR_SYNC_Pos))
#define FLEX_US_MR_PAR_Pos                    _U_(9)                                               /**< (FLEX_US_MR) Parity Type Position */
#define FLEX_US_MR_PAR_Msk                    (_U_(0x7) << FLEX_US_MR_PAR_Pos)                     /**< (FLEX_US_MR) Parity Type Mask */
#define FLEX_US_MR_PAR(value)                 (FLEX_US_MR_PAR_Msk & ((value) << FLEX_US_MR_PAR_Pos))
#define   FLEX_US_MR_PAR_EVEN_Val             _U_(0x0)                                             /**< (FLEX_US_MR) Even parity  */
#define   FLEX_US_MR_PAR_ODD_Val              _U_(0x1)                                             /**< (FLEX_US_MR) Odd parity  */
#define   FLEX_US_MR_PAR_SPACE_Val            _U_(0x2)                                             /**< (FLEX_US_MR) Parity forced to 0 (Space)  */
#define   FLEX_US_MR_PAR_MARK_Val             _U_(0x3)                                             /**< (FLEX_US_MR) Parity forced to 1 (Mark)  */
#define   FLEX_US_MR_PAR_NO_Val               _U_(0x4)                                             /**< (FLEX_US_MR) No parity  */
#define   FLEX_US_MR_PAR_MULTIDROP_Val        _U_(0x6)                                             /**< (FLEX_US_MR) Multidrop mode  */
#define FLEX_US_MR_PAR_EVEN                   (FLEX_US_MR_PAR_EVEN_Val << FLEX_US_MR_PAR_Pos)      /**< (FLEX_US_MR) Even parity Position  */
#define FLEX_US_MR_PAR_ODD                    (FLEX_US_MR_PAR_ODD_Val << FLEX_US_MR_PAR_Pos)       /**< (FLEX_US_MR) Odd parity Position  */
#define FLEX_US_MR_PAR_SPACE                  (FLEX_US_MR_PAR_SPACE_Val << FLEX_US_MR_PAR_Pos)     /**< (FLEX_US_MR) Parity forced to 0 (Space) Position  */
#define FLEX_US_MR_PAR_MARK                   (FLEX_US_MR_PAR_MARK_Val << FLEX_US_MR_PAR_Pos)      /**< (FLEX_US_MR) Parity forced to 1 (Mark) Position  */
#define FLEX_US_MR_PAR_NO                     (FLEX_US_MR_PAR_NO_Val << FLEX_US_MR_PAR_Pos)        /**< (FLEX_US_MR) No parity Position  */
#define FLEX_US_MR_PAR_MULTIDROP              (FLEX_US_MR_PAR_MULTIDROP_Val << FLEX_US_MR_PAR_Pos) /**< (FLEX_US_MR) Multidrop mode Position  */
#define FLEX_US_MR_NBSTOP_Pos                 _U_(12)                                              /**< (FLEX_US_MR) Number of Stop Bits Position */
#define FLEX_US_MR_NBSTOP_Msk                 (_U_(0x3) << FLEX_US_MR_NBSTOP_Pos)                  /**< (FLEX_US_MR) Number of Stop Bits Mask */
#define FLEX_US_MR_NBSTOP(value)              (FLEX_US_MR_NBSTOP_Msk & ((value) << FLEX_US_MR_NBSTOP_Pos))
#define   FLEX_US_MR_NBSTOP_1_BIT_Val         _U_(0x0)                                             /**< (FLEX_US_MR) 1 stop bit  */
#define   FLEX_US_MR_NBSTOP_1_5_BIT_Val       _U_(0x1)                                             /**< (FLEX_US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)  */
#define   FLEX_US_MR_NBSTOP_2_BIT_Val         _U_(0x2)                                             /**< (FLEX_US_MR) 2 stop bits  */
#define FLEX_US_MR_NBSTOP_1_BIT               (FLEX_US_MR_NBSTOP_1_BIT_Val << FLEX_US_MR_NBSTOP_Pos) /**< (FLEX_US_MR) 1 stop bit Position  */
#define FLEX_US_MR_NBSTOP_1_5_BIT             (FLEX_US_MR_NBSTOP_1_5_BIT_Val << FLEX_US_MR_NBSTOP_Pos) /**< (FLEX_US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) Position  */
#define FLEX_US_MR_NBSTOP_2_BIT               (FLEX_US_MR_NBSTOP_2_BIT_Val << FLEX_US_MR_NBSTOP_Pos) /**< (FLEX_US_MR) 2 stop bits Position  */
#define FLEX_US_MR_CHMODE_Pos                 _U_(14)                                              /**< (FLEX_US_MR) Channel Mode Position */
#define FLEX_US_MR_CHMODE_Msk                 (_U_(0x3) << FLEX_US_MR_CHMODE_Pos)                  /**< (FLEX_US_MR) Channel Mode Mask */
#define FLEX_US_MR_CHMODE(value)              (FLEX_US_MR_CHMODE_Msk & ((value) << FLEX_US_MR_CHMODE_Pos))
#define   FLEX_US_MR_CHMODE_NORMAL_Val        _U_(0x0)                                             /**< (FLEX_US_MR) Normal mode  */
#define   FLEX_US_MR_CHMODE_AUTOMATIC_Val     _U_(0x1)                                             /**< (FLEX_US_MR) Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   FLEX_US_MR_CHMODE_LOCAL_LOOPBACK_Val _U_(0x2)                                             /**< (FLEX_US_MR) Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   FLEX_US_MR_CHMODE_REMOTE_LOOPBACK_Val _U_(0x3)                                             /**< (FLEX_US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define FLEX_US_MR_CHMODE_NORMAL              (FLEX_US_MR_CHMODE_NORMAL_Val << FLEX_US_MR_CHMODE_Pos) /**< (FLEX_US_MR) Normal mode Position  */
#define FLEX_US_MR_CHMODE_AUTOMATIC           (FLEX_US_MR_CHMODE_AUTOMATIC_Val << FLEX_US_MR_CHMODE_Pos) /**< (FLEX_US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position  */
#define FLEX_US_MR_CHMODE_LOCAL_LOOPBACK      (FLEX_US_MR_CHMODE_LOCAL_LOOPBACK_Val << FLEX_US_MR_CHMODE_Pos) /**< (FLEX_US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position  */
#define FLEX_US_MR_CHMODE_REMOTE_LOOPBACK     (FLEX_US_MR_CHMODE_REMOTE_LOOPBACK_Val << FLEX_US_MR_CHMODE_Pos) /**< (FLEX_US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position  */
#define FLEX_US_MR_MSBF_Pos                   _U_(16)                                              /**< (FLEX_US_MR) Bit Order Position */
#define FLEX_US_MR_MSBF_Msk                   (_U_(0x1) << FLEX_US_MR_MSBF_Pos)                    /**< (FLEX_US_MR) Bit Order Mask */
#define FLEX_US_MR_MSBF(value)                (FLEX_US_MR_MSBF_Msk & ((value) << FLEX_US_MR_MSBF_Pos))
#define FLEX_US_MR_MODE9_Pos                  _U_(17)                                              /**< (FLEX_US_MR) 9-bit Character Length Position */
#define FLEX_US_MR_MODE9_Msk                  (_U_(0x1) << FLEX_US_MR_MODE9_Pos)                   /**< (FLEX_US_MR) 9-bit Character Length Mask */
#define FLEX_US_MR_MODE9(value)               (FLEX_US_MR_MODE9_Msk & ((value) << FLEX_US_MR_MODE9_Pos))
#define FLEX_US_MR_CLKO_Pos                   _U_(18)                                              /**< (FLEX_US_MR) Clock Output Select Position */
#define FLEX_US_MR_CLKO_Msk                   (_U_(0x1) << FLEX_US_MR_CLKO_Pos)                    /**< (FLEX_US_MR) Clock Output Select Mask */
#define FLEX_US_MR_CLKO(value)                (FLEX_US_MR_CLKO_Msk & ((value) << FLEX_US_MR_CLKO_Pos))
#define FLEX_US_MR_OVER_Pos                   _U_(19)                                              /**< (FLEX_US_MR) Oversampling Mode Position */
#define FLEX_US_MR_OVER_Msk                   (_U_(0x1) << FLEX_US_MR_OVER_Pos)                    /**< (FLEX_US_MR) Oversampling Mode Mask */
#define FLEX_US_MR_OVER(value)                (FLEX_US_MR_OVER_Msk & ((value) << FLEX_US_MR_OVER_Pos))
#define FLEX_US_MR_INACK_Pos                  _U_(20)                                              /**< (FLEX_US_MR) Inhibit Non Acknowledge Position */
#define FLEX_US_MR_INACK_Msk                  (_U_(0x1) << FLEX_US_MR_INACK_Pos)                   /**< (FLEX_US_MR) Inhibit Non Acknowledge Mask */
#define FLEX_US_MR_INACK(value)               (FLEX_US_MR_INACK_Msk & ((value) << FLEX_US_MR_INACK_Pos))
#define FLEX_US_MR_DSNACK_Pos                 _U_(21)                                              /**< (FLEX_US_MR) Disable Successive NACK Position */
#define FLEX_US_MR_DSNACK_Msk                 (_U_(0x1) << FLEX_US_MR_DSNACK_Pos)                  /**< (FLEX_US_MR) Disable Successive NACK Mask */
#define FLEX_US_MR_DSNACK(value)              (FLEX_US_MR_DSNACK_Msk & ((value) << FLEX_US_MR_DSNACK_Pos))
#define FLEX_US_MR_VAR_SYNC_Pos               _U_(22)                                              /**< (FLEX_US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Position */
#define FLEX_US_MR_VAR_SYNC_Msk               (_U_(0x1) << FLEX_US_MR_VAR_SYNC_Pos)                /**< (FLEX_US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Mask */
#define FLEX_US_MR_VAR_SYNC(value)            (FLEX_US_MR_VAR_SYNC_Msk & ((value) << FLEX_US_MR_VAR_SYNC_Pos))
#define FLEX_US_MR_INVDATA_Pos                _U_(23)                                              /**< (FLEX_US_MR) Inverted Data Position */
#define FLEX_US_MR_INVDATA_Msk                (_U_(0x1) << FLEX_US_MR_INVDATA_Pos)                 /**< (FLEX_US_MR) Inverted Data Mask */
#define FLEX_US_MR_INVDATA(value)             (FLEX_US_MR_INVDATA_Msk & ((value) << FLEX_US_MR_INVDATA_Pos))
#define FLEX_US_MR_MAX_ITERATION_Pos          _U_(24)                                              /**< (FLEX_US_MR) Maximum Number of Automatic Iteration Position */
#define FLEX_US_MR_MAX_ITERATION_Msk          (_U_(0x7) << FLEX_US_MR_MAX_ITERATION_Pos)           /**< (FLEX_US_MR) Maximum Number of Automatic Iteration Mask */
#define FLEX_US_MR_MAX_ITERATION(value)       (FLEX_US_MR_MAX_ITERATION_Msk & ((value) << FLEX_US_MR_MAX_ITERATION_Pos))
#define FLEX_US_MR_FILTER_Pos                 _U_(28)                                              /**< (FLEX_US_MR) Receive Line Filter Position */
#define FLEX_US_MR_FILTER_Msk                 (_U_(0x1) << FLEX_US_MR_FILTER_Pos)                  /**< (FLEX_US_MR) Receive Line Filter Mask */
#define FLEX_US_MR_FILTER(value)              (FLEX_US_MR_FILTER_Msk & ((value) << FLEX_US_MR_FILTER_Pos))
#define FLEX_US_MR_MAN_Pos                    _U_(29)                                              /**< (FLEX_US_MR) Manchester Encoder/Decoder Enable Position */
#define FLEX_US_MR_MAN_Msk                    (_U_(0x1) << FLEX_US_MR_MAN_Pos)                     /**< (FLEX_US_MR) Manchester Encoder/Decoder Enable Mask */
#define FLEX_US_MR_MAN(value)                 (FLEX_US_MR_MAN_Msk & ((value) << FLEX_US_MR_MAN_Pos))
#define FLEX_US_MR_MODSYNC_Pos                _U_(30)                                              /**< (FLEX_US_MR) Manchester Synchronization Mode Position */
#define FLEX_US_MR_MODSYNC_Msk                (_U_(0x1) << FLEX_US_MR_MODSYNC_Pos)                 /**< (FLEX_US_MR) Manchester Synchronization Mode Mask */
#define FLEX_US_MR_MODSYNC(value)             (FLEX_US_MR_MODSYNC_Msk & ((value) << FLEX_US_MR_MODSYNC_Pos))
#define FLEX_US_MR_ONEBIT_Pos                 _U_(31)                                              /**< (FLEX_US_MR) Start Frame Delimiter Selector Position */
#define FLEX_US_MR_ONEBIT_Msk                 (_U_(0x1) << FLEX_US_MR_ONEBIT_Pos)                  /**< (FLEX_US_MR) Start Frame Delimiter Selector Mask */
#define FLEX_US_MR_ONEBIT(value)              (FLEX_US_MR_ONEBIT_Msk & ((value) << FLEX_US_MR_ONEBIT_Pos))
#define FLEX_US_MR_Msk                        _U_(0xF7FFFFFF)                                      /**< (FLEX_US_MR) Register Mask  */


/* -------- FLEX_US_IER : (FLEXCOM Offset: 0x208) ( /W 32) USART Interrupt Enable Register -------- */
#define FLEX_US_IER_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_IER) RXRDY Interrupt Enable Position */
#define FLEX_US_IER_RXRDY_Msk                 (_U_(0x1) << FLEX_US_IER_RXRDY_Pos)                  /**< (FLEX_US_IER) RXRDY Interrupt Enable Mask */
#define FLEX_US_IER_RXRDY(value)              (FLEX_US_IER_RXRDY_Msk & ((value) << FLEX_US_IER_RXRDY_Pos))
#define FLEX_US_IER_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_IER) TXRDY Interrupt Enable Position */
#define FLEX_US_IER_TXRDY_Msk                 (_U_(0x1) << FLEX_US_IER_TXRDY_Pos)                  /**< (FLEX_US_IER) TXRDY Interrupt Enable Mask */
#define FLEX_US_IER_TXRDY(value)              (FLEX_US_IER_TXRDY_Msk & ((value) << FLEX_US_IER_TXRDY_Pos))
#define FLEX_US_IER_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_IER) Receiver Break Interrupt Enable Position */
#define FLEX_US_IER_RXBRK_Msk                 (_U_(0x1) << FLEX_US_IER_RXBRK_Pos)                  /**< (FLEX_US_IER) Receiver Break Interrupt Enable Mask */
#define FLEX_US_IER_RXBRK(value)              (FLEX_US_IER_RXBRK_Msk & ((value) << FLEX_US_IER_RXBRK_Pos))
#define FLEX_US_IER_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_IER) Overrun Error Interrupt Enable Position */
#define FLEX_US_IER_OVRE_Msk                  (_U_(0x1) << FLEX_US_IER_OVRE_Pos)                   /**< (FLEX_US_IER) Overrun Error Interrupt Enable Mask */
#define FLEX_US_IER_OVRE(value)               (FLEX_US_IER_OVRE_Msk & ((value) << FLEX_US_IER_OVRE_Pos))
#define FLEX_US_IER_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_IER) Framing Error Interrupt Enable Position */
#define FLEX_US_IER_FRAME_Msk                 (_U_(0x1) << FLEX_US_IER_FRAME_Pos)                  /**< (FLEX_US_IER) Framing Error Interrupt Enable Mask */
#define FLEX_US_IER_FRAME(value)              (FLEX_US_IER_FRAME_Msk & ((value) << FLEX_US_IER_FRAME_Pos))
#define FLEX_US_IER_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_IER) Parity Error Interrupt Enable Position */
#define FLEX_US_IER_PARE_Msk                  (_U_(0x1) << FLEX_US_IER_PARE_Pos)                   /**< (FLEX_US_IER) Parity Error Interrupt Enable Mask */
#define FLEX_US_IER_PARE(value)               (FLEX_US_IER_PARE_Msk & ((value) << FLEX_US_IER_PARE_Pos))
#define FLEX_US_IER_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_IER) Timeout Interrupt Enable Position */
#define FLEX_US_IER_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_IER_TIMEOUT_Pos)                /**< (FLEX_US_IER) Timeout Interrupt Enable Mask */
#define FLEX_US_IER_TIMEOUT(value)            (FLEX_US_IER_TIMEOUT_Msk & ((value) << FLEX_US_IER_TIMEOUT_Pos))
#define FLEX_US_IER_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_IER) TXEMPTY Interrupt Enable Position */
#define FLEX_US_IER_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_IER_TXEMPTY_Pos)                /**< (FLEX_US_IER) TXEMPTY Interrupt Enable Mask */
#define FLEX_US_IER_TXEMPTY(value)            (FLEX_US_IER_TXEMPTY_Msk & ((value) << FLEX_US_IER_TXEMPTY_Pos))
#define FLEX_US_IER_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define FLEX_US_IER_ITER_Msk                  (_U_(0x1) << FLEX_US_IER_ITER_Pos)                   /**< (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define FLEX_US_IER_ITER(value)               (FLEX_US_IER_ITER_Msk & ((value) << FLEX_US_IER_ITER_Pos))
#define FLEX_US_IER_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_IER) Non Acknowledge Interrupt Enable Position */
#define FLEX_US_IER_NACK_Msk                  (_U_(0x1) << FLEX_US_IER_NACK_Pos)                   /**< (FLEX_US_IER) Non Acknowledge Interrupt Enable Mask */
#define FLEX_US_IER_NACK(value)               (FLEX_US_IER_NACK_Msk & ((value) << FLEX_US_IER_NACK_Pos))
#define FLEX_US_IER_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Position */
#define FLEX_US_IER_CTSIC_Msk                 (_U_(0x1) << FLEX_US_IER_CTSIC_Pos)                  /**< (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define FLEX_US_IER_CTSIC(value)              (FLEX_US_IER_CTSIC_Msk & ((value) << FLEX_US_IER_CTSIC_Pos))
#define FLEX_US_IER_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_IER) Comparison Interrupt Enable Position */
#define FLEX_US_IER_CMP_Msk                   (_U_(0x1) << FLEX_US_IER_CMP_Pos)                    /**< (FLEX_US_IER) Comparison Interrupt Enable Mask */
#define FLEX_US_IER_CMP(value)                (FLEX_US_IER_CMP_Msk & ((value) << FLEX_US_IER_CMP_Pos))
#define FLEX_US_IER_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_IER) Manchester Error Interrupt Enable Position */
#define FLEX_US_IER_MANE_Msk                  (_U_(0x1) << FLEX_US_IER_MANE_Pos)                   /**< (FLEX_US_IER) Manchester Error Interrupt Enable Mask */
#define FLEX_US_IER_MANE(value)               (FLEX_US_IER_MANE_Msk & ((value) << FLEX_US_IER_MANE_Pos))
#define FLEX_US_IER_Msk                       _U_(0x014827E7)                                      /**< (FLEX_US_IER) Register Mask  */

