Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/flexcom.h
/* -------- FLEX_US_LINMR : (FLEXCOM Offset: 0x254) (R/W 32) USART LIN Mode Register -------- */
#define FLEX_US_LINMR_NACT_Pos                _U_(0)                                               /**< (FLEX_US_LINMR) LIN Node Action Position */
#define FLEX_US_LINMR_NACT_Msk                (_U_(0x3) << FLEX_US_LINMR_NACT_Pos)                 /**< (FLEX_US_LINMR) LIN Node Action Mask */
#define FLEX_US_LINMR_NACT(value)             (FLEX_US_LINMR_NACT_Msk & ((value) << FLEX_US_LINMR_NACT_Pos))
#define   FLEX_US_LINMR_NACT_PUBLISH_Val      _U_(0x0)                                             /**< (FLEX_US_LINMR) The USART transmits the response.  */
#define   FLEX_US_LINMR_NACT_SUBSCRIBE_Val    _U_(0x1)                                             /**< (FLEX_US_LINMR) The USART receives the response.  */
#define   FLEX_US_LINMR_NACT_IGNORE_Val       _U_(0x2)                                             /**< (FLEX_US_LINMR) The USART does not transmit and does not receive the response.  */
#define FLEX_US_LINMR_NACT_PUBLISH            (FLEX_US_LINMR_NACT_PUBLISH_Val << FLEX_US_LINMR_NACT_Pos) /**< (FLEX_US_LINMR) The USART transmits the response. Position  */
#define FLEX_US_LINMR_NACT_SUBSCRIBE          (FLEX_US_LINMR_NACT_SUBSCRIBE_Val << FLEX_US_LINMR_NACT_Pos) /**< (FLEX_US_LINMR) The USART receives the response. Position  */
#define FLEX_US_LINMR_NACT_IGNORE             (FLEX_US_LINMR_NACT_IGNORE_Val << FLEX_US_LINMR_NACT_Pos) /**< (FLEX_US_LINMR) The USART does not transmit and does not receive the response. Position  */
#define FLEX_US_LINMR_PARDIS_Pos              _U_(2)                                               /**< (FLEX_US_LINMR) Parity Disable Position */
#define FLEX_US_LINMR_PARDIS_Msk              (_U_(0x1) << FLEX_US_LINMR_PARDIS_Pos)               /**< (FLEX_US_LINMR) Parity Disable Mask */
#define FLEX_US_LINMR_PARDIS(value)           (FLEX_US_LINMR_PARDIS_Msk & ((value) << FLEX_US_LINMR_PARDIS_Pos))
#define FLEX_US_LINMR_CHKDIS_Pos              _U_(3)                                               /**< (FLEX_US_LINMR) Checksum Disable Position */
#define FLEX_US_LINMR_CHKDIS_Msk              (_U_(0x1) << FLEX_US_LINMR_CHKDIS_Pos)               /**< (FLEX_US_LINMR) Checksum Disable Mask */
#define FLEX_US_LINMR_CHKDIS(value)           (FLEX_US_LINMR_CHKDIS_Msk & ((value) << FLEX_US_LINMR_CHKDIS_Pos))
#define FLEX_US_LINMR_CHKTYP_Pos              _U_(4)                                               /**< (FLEX_US_LINMR) Checksum Type Position */
#define FLEX_US_LINMR_CHKTYP_Msk              (_U_(0x1) << FLEX_US_LINMR_CHKTYP_Pos)               /**< (FLEX_US_LINMR) Checksum Type Mask */
#define FLEX_US_LINMR_CHKTYP(value)           (FLEX_US_LINMR_CHKTYP_Msk & ((value) << FLEX_US_LINMR_CHKTYP_Pos))
#define FLEX_US_LINMR_DLM_Pos                 _U_(5)                                               /**< (FLEX_US_LINMR) Data Length Mode Position */
#define FLEX_US_LINMR_DLM_Msk                 (_U_(0x1) << FLEX_US_LINMR_DLM_Pos)                  /**< (FLEX_US_LINMR) Data Length Mode Mask */
#define FLEX_US_LINMR_DLM(value)              (FLEX_US_LINMR_DLM_Msk & ((value) << FLEX_US_LINMR_DLM_Pos))
#define FLEX_US_LINMR_FSDIS_Pos               _U_(6)                                               /**< (FLEX_US_LINMR) Frame Slot Mode Disable Position */
#define FLEX_US_LINMR_FSDIS_Msk               (_U_(0x1) << FLEX_US_LINMR_FSDIS_Pos)                /**< (FLEX_US_LINMR) Frame Slot Mode Disable Mask */
#define FLEX_US_LINMR_FSDIS(value)            (FLEX_US_LINMR_FSDIS_Msk & ((value) << FLEX_US_LINMR_FSDIS_Pos))
#define FLEX_US_LINMR_WKUPTYP_Pos             _U_(7)                                               /**< (FLEX_US_LINMR) Wakeup Signal Type Position */
#define FLEX_US_LINMR_WKUPTYP_Msk             (_U_(0x1) << FLEX_US_LINMR_WKUPTYP_Pos)              /**< (FLEX_US_LINMR) Wakeup Signal Type Mask */
#define FLEX_US_LINMR_WKUPTYP(value)          (FLEX_US_LINMR_WKUPTYP_Msk & ((value) << FLEX_US_LINMR_WKUPTYP_Pos))
#define FLEX_US_LINMR_DLC_Pos                 _U_(8)                                               /**< (FLEX_US_LINMR) Data Length Control Position */
#define FLEX_US_LINMR_DLC_Msk                 (_U_(0xFF) << FLEX_US_LINMR_DLC_Pos)                 /**< (FLEX_US_LINMR) Data Length Control Mask */
#define FLEX_US_LINMR_DLC(value)              (FLEX_US_LINMR_DLC_Msk & ((value) << FLEX_US_LINMR_DLC_Pos))
#define FLEX_US_LINMR_PDCM_Pos                _U_(16)                                              /**< (FLEX_US_LINMR) DMAC Mode Position */
#define FLEX_US_LINMR_PDCM_Msk                (_U_(0x1) << FLEX_US_LINMR_PDCM_Pos)                 /**< (FLEX_US_LINMR) DMAC Mode Mask */
#define FLEX_US_LINMR_PDCM(value)             (FLEX_US_LINMR_PDCM_Msk & ((value) << FLEX_US_LINMR_PDCM_Pos))
#define FLEX_US_LINMR_SYNCDIS_Pos             _U_(17)                                              /**< (FLEX_US_LINMR) Synchronization Disable Position */
#define FLEX_US_LINMR_SYNCDIS_Msk             (_U_(0x1) << FLEX_US_LINMR_SYNCDIS_Pos)              /**< (FLEX_US_LINMR) Synchronization Disable Mask */
#define FLEX_US_LINMR_SYNCDIS(value)          (FLEX_US_LINMR_SYNCDIS_Msk & ((value) << FLEX_US_LINMR_SYNCDIS_Pos))
#define FLEX_US_LINMR_Msk                     _U_(0x0003FFFF)                                      /**< (FLEX_US_LINMR) Register Mask  */


/* -------- FLEX_US_LINIR : (FLEXCOM Offset: 0x258) (R/W 32) USART LIN Identifier Register -------- */
#define FLEX_US_LINIR_IDCHR_Pos               _U_(0)                                               /**< (FLEX_US_LINIR) Identifier Character Position */
#define FLEX_US_LINIR_IDCHR_Msk               (_U_(0xFF) << FLEX_US_LINIR_IDCHR_Pos)               /**< (FLEX_US_LINIR) Identifier Character Mask */
#define FLEX_US_LINIR_IDCHR(value)            (FLEX_US_LINIR_IDCHR_Msk & ((value) << FLEX_US_LINIR_IDCHR_Pos))
#define FLEX_US_LINIR_Msk                     _U_(0x000000FF)                                      /**< (FLEX_US_LINIR) Register Mask  */


