Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/flexcom.h
/* -------- FLEX_TWI_THR : (FLEXCOM Offset: 0x634) ( /W 32) TWI Transmit Holding Register -------- */
#define FLEX_TWI_THR_TXDATA_Pos               _U_(0)                                               /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data Position */
#define FLEX_TWI_THR_TXDATA_Msk               (_U_(0xFF) << FLEX_TWI_THR_TXDATA_Pos)               /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data Mask */
#define FLEX_TWI_THR_TXDATA(value)            (FLEX_TWI_THR_TXDATA_Msk & ((value) << FLEX_TWI_THR_TXDATA_Pos))
#define FLEX_TWI_THR_Msk                      _U_(0x000000FF)                                      /**< (FLEX_TWI_THR) Register Mask  */

/* FIFO_ENABLED mode */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA0_Pos _U_(0)                                               /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 0 Position */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA0_Msk (_U_(0xFF) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA0_Pos) /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 0 Mask */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA0(value) (FLEX_TWI_THR_FIFO_ENABLED_TXDATA0_Msk & ((value) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA0_Pos))
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA1_Pos _U_(8)                                               /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 1 Position */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA1_Msk (_U_(0xFF) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA1_Pos) /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 1 Mask */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA1(value) (FLEX_TWI_THR_FIFO_ENABLED_TXDATA1_Msk & ((value) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA1_Pos))
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA2_Pos _U_(16)                                              /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 2 Position */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA2_Msk (_U_(0xFF) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA2_Pos) /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 2 Mask */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA2(value) (FLEX_TWI_THR_FIFO_ENABLED_TXDATA2_Msk & ((value) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA2_Pos))
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA3_Pos _U_(24)                                              /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 3 Position */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA3_Msk (_U_(0xFF) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA3_Pos) /**< (FLEX_TWI_THR) Master or Slave Transmit Holding Data 3 Mask */
#define FLEX_TWI_THR_FIFO_ENABLED_TXDATA3(value) (FLEX_TWI_THR_FIFO_ENABLED_TXDATA3_Msk & ((value) << FLEX_TWI_THR_FIFO_ENABLED_TXDATA3_Pos))
#define FLEX_TWI_THR_FIFO_ENABLED_Msk         _U_(0xFFFFFFFF)                                       /**< (FLEX_TWI_THR_FIFO_ENABLED) Register Mask  */


/* -------- FLEX_TWI_SMBTR : (FLEXCOM Offset: 0x638) (R/W 32) TWI SMBus Timing Register -------- */
#define FLEX_TWI_SMBTR_PRESC_Pos              _U_(0)                                               /**< (FLEX_TWI_SMBTR) SMBus Clock Prescaler Position */
#define FLEX_TWI_SMBTR_PRESC_Msk              (_U_(0xF) << FLEX_TWI_SMBTR_PRESC_Pos)               /**< (FLEX_TWI_SMBTR) SMBus Clock Prescaler Mask */
#define FLEX_TWI_SMBTR_PRESC(value)           (FLEX_TWI_SMBTR_PRESC_Msk & ((value) << FLEX_TWI_SMBTR_PRESC_Pos))
#define FLEX_TWI_SMBTR_TLOWS_Pos              _U_(8)                                               /**< (FLEX_TWI_SMBTR) Slave Clock Stretch Maximum Cycles Position */
#define FLEX_TWI_SMBTR_TLOWS_Msk              (_U_(0xFF) << FLEX_TWI_SMBTR_TLOWS_Pos)              /**< (FLEX_TWI_SMBTR) Slave Clock Stretch Maximum Cycles Mask */
#define FLEX_TWI_SMBTR_TLOWS(value)           (FLEX_TWI_SMBTR_TLOWS_Msk & ((value) << FLEX_TWI_SMBTR_TLOWS_Pos))
#define FLEX_TWI_SMBTR_TLOWM_Pos              _U_(16)                                              /**< (FLEX_TWI_SMBTR) Master Clock Stretch Maximum Cycles Position */
#define FLEX_TWI_SMBTR_TLOWM_Msk              (_U_(0xFF) << FLEX_TWI_SMBTR_TLOWM_Pos)              /**< (FLEX_TWI_SMBTR) Master Clock Stretch Maximum Cycles Mask */
#define FLEX_TWI_SMBTR_TLOWM(value)           (FLEX_TWI_SMBTR_TLOWM_Msk & ((value) << FLEX_TWI_SMBTR_TLOWM_Pos))
#define FLEX_TWI_SMBTR_THMAX_Pos              _U_(24)                                              /**< (FLEX_TWI_SMBTR) Clock High Maximum Cycles Position */
#define FLEX_TWI_SMBTR_THMAX_Msk              (_U_(0xFF) << FLEX_TWI_SMBTR_THMAX_Pos)              /**< (FLEX_TWI_SMBTR) Clock High Maximum Cycles Mask */
#define FLEX_TWI_SMBTR_THMAX(value)           (FLEX_TWI_SMBTR_THMAX_Msk & ((value) << FLEX_TWI_SMBTR_THMAX_Pos))
#define FLEX_TWI_SMBTR_Msk                    _U_(0xFFFFFF0F)                                      /**< (FLEX_TWI_SMBTR) Register Mask  */


/* -------- FLEX_TWI_ACR : (FLEXCOM Offset: 0x640) (R/W 32) TWI Alternative Command Register -------- */
#define FLEX_TWI_ACR_DATAL_Pos                _U_(0)                                               /**< (FLEX_TWI_ACR) Data Length Position */
#define FLEX_TWI_ACR_DATAL_Msk                (_U_(0xFF) << FLEX_TWI_ACR_DATAL_Pos)                /**< (FLEX_TWI_ACR) Data Length Mask */
#define FLEX_TWI_ACR_DATAL(value)             (FLEX_TWI_ACR_DATAL_Msk & ((value) << FLEX_TWI_ACR_DATAL_Pos))
#define FLEX_TWI_ACR_DIR_Pos                  _U_(8)                                               /**< (FLEX_TWI_ACR) Transfer Direction Position */
#define FLEX_TWI_ACR_DIR_Msk                  (_U_(0x1) << FLEX_TWI_ACR_DIR_Pos)                   /**< (FLEX_TWI_ACR) Transfer Direction Mask */
#define FLEX_TWI_ACR_DIR(value)               (FLEX_TWI_ACR_DIR_Msk & ((value) << FLEX_TWI_ACR_DIR_Pos))
#define FLEX_TWI_ACR_PEC_Pos                  _U_(9)                                               /**< (FLEX_TWI_ACR) PEC Request (SMBus Mode only) Position */
#define FLEX_TWI_ACR_PEC_Msk                  (_U_(0x1) << FLEX_TWI_ACR_PEC_Pos)                   /**< (FLEX_TWI_ACR) PEC Request (SMBus Mode only) Mask */
#define FLEX_TWI_ACR_PEC(value)               (FLEX_TWI_ACR_PEC_Msk & ((value) << FLEX_TWI_ACR_PEC_Pos))
#define FLEX_TWI_ACR_NDATAL_Pos               _U_(16)                                              /**< (FLEX_TWI_ACR) Next Data Length Position */
#define FLEX_TWI_ACR_NDATAL_Msk               (_U_(0xFF) << FLEX_TWI_ACR_NDATAL_Pos)               /**< (FLEX_TWI_ACR) Next Data Length Mask */
#define FLEX_TWI_ACR_NDATAL(value)            (FLEX_TWI_ACR_NDATAL_Msk & ((value) << FLEX_TWI_ACR_NDATAL_Pos))
#define FLEX_TWI_ACR_NDIR_Pos                 _U_(24)                                              /**< (FLEX_TWI_ACR) Next Transfer Direction Position */
#define FLEX_TWI_ACR_NDIR_Msk                 (_U_(0x1) << FLEX_TWI_ACR_NDIR_Pos)                  /**< (FLEX_TWI_ACR) Next Transfer Direction Mask */
#define FLEX_TWI_ACR_NDIR(value)              (FLEX_TWI_ACR_NDIR_Msk & ((value) << FLEX_TWI_ACR_NDIR_Pos))
#define FLEX_TWI_ACR_NPEC_Pos                 _U_(25)                                              /**< (FLEX_TWI_ACR) Next PEC Request (SMBus Mode only) Position */
#define FLEX_TWI_ACR_NPEC_Msk                 (_U_(0x1) << FLEX_TWI_ACR_NPEC_Pos)                  /**< (FLEX_TWI_ACR) Next PEC Request (SMBus Mode only) Mask */
#define FLEX_TWI_ACR_NPEC(value)              (FLEX_TWI_ACR_NPEC_Msk & ((value) << FLEX_TWI_ACR_NPEC_Pos))
#define FLEX_TWI_ACR_Msk                      _U_(0x03FF03FF)                                      /**< (FLEX_TWI_ACR) Register Mask  */


/* -------- FLEX_TWI_FILTR : (FLEXCOM Offset: 0x644) (R/W 32) TWI Filter Register -------- */
#define FLEX_TWI_FILTR_FILT_Pos               _U_(0)                                               /**< (FLEX_TWI_FILTR) RX Digital Filter Position */
#define FLEX_TWI_FILTR_FILT_Msk               (_U_(0x1) << FLEX_TWI_FILTR_FILT_Pos)                /**< (FLEX_TWI_FILTR) RX Digital Filter Mask */
#define FLEX_TWI_FILTR_FILT(value)            (FLEX_TWI_FILTR_FILT_Msk & ((value) << FLEX_TWI_FILTR_FILT_Pos))
#define FLEX_TWI_FILTR_PADFEN_Pos             _U_(1)                                               /**< (FLEX_TWI_FILTR) PAD Filter Enable Position */
#define FLEX_TWI_FILTR_PADFEN_Msk             (_U_(0x1) << FLEX_TWI_FILTR_PADFEN_Pos)              /**< (FLEX_TWI_FILTR) PAD Filter Enable Mask */
#define FLEX_TWI_FILTR_PADFEN(value)          (FLEX_TWI_FILTR_PADFEN_Msk & ((value) << FLEX_TWI_FILTR_PADFEN_Pos))
#define FLEX_TWI_FILTR_PADFCFG_Pos            _U_(2)                                               /**< (FLEX_TWI_FILTR) PAD Filter Config Position */
#define FLEX_TWI_FILTR_PADFCFG_Msk            (_U_(0x1) << FLEX_TWI_FILTR_PADFCFG_Pos)             /**< (FLEX_TWI_FILTR) PAD Filter Config Mask */
#define FLEX_TWI_FILTR_PADFCFG(value)         (FLEX_TWI_FILTR_PADFCFG_Msk & ((value) << FLEX_TWI_FILTR_PADFCFG_Pos))
#define FLEX_TWI_FILTR_THRES_Pos              _U_(8)                                               /**< (FLEX_TWI_FILTR) Digital Filter Threshold Position */
#define FLEX_TWI_FILTR_THRES_Msk              (_U_(0x7) << FLEX_TWI_FILTR_THRES_Pos)               /**< (FLEX_TWI_FILTR) Digital Filter Threshold Mask */
#define FLEX_TWI_FILTR_THRES(value)           (FLEX_TWI_FILTR_THRES_Msk & ((value) << FLEX_TWI_FILTR_THRES_Pos))
#define FLEX_TWI_FILTR_Msk                    _U_(0x00000707)                                      /**< (FLEX_TWI_FILTR) Register Mask  */


